
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
<<<<<<< HEAD
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь(); 
	КодПоиска = ПользовательИБ.Имя; 
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Студент) Тогда
		
		СтудентСсылка = Справочники.Студенты.НайтиПоРеквизиту("Никнейм",КодПоиска);
		ПараметрыСеанса.ТекущийСтудент = СтудентСсылка;
		
	КонецЕсли;
	
=======
	//КодПоиска = ИмяПользователя() ;
	//СтудентСсылка = Справочники.Студенты.НайтиПоРеквизиту("Никнейм",КодПоиска);
	//Если НЕ СтудентСсылка.Пустая() Тогда
	//	ПараметрыСеанса.ТекущийСтудент = СтудентСсылка;
	//КонецЕсли;
	
	 ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь(); 
	 КодПоиска = ПользовательИБ.Имя;
	 СтудентСсылка = Справочники.Студенты.НайтиПоРеквизиту("Никнейм",КодПоиска);
	 ПараметрыСеанса.ТекущийСтудент = СтудентСсылка;
>>>>>>> 34642ff6e2a72d3d02f6c40c6ce76596a950f23e
КонецПроцедуры
