
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//КодПоиска = ИмяПользователя() ;
	//СтудентСсылка = Справочники.Студенты.НайтиПоРеквизиту("Никнейм",КодПоиска);
	//Если НЕ СтудентСсылка.Пустая() Тогда
	//	ПараметрыСеанса.ТекущийСтудент = СтудентСсылка;
	//КонецЕсли;
	
	 ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь(); 
	 КодПоиска = ПользовательИБ.Имя;
	 СтудентСсылка = Справочники.Студенты.НайтиПоРеквизиту("Никнейм",КодПоиска);
	 ПараметрыСеанса.ТекущийСтудент = СтудентСсылка;
КонецПроцедуры
