
&НаКлиенте
Асинх Процедура АдресКартинкиВХНажатие(Элемент, СтандартнаяОбработка)
	
	АдресИОписаниеФайла = Ждать ОбщийКлиентскийМодуль.ПолучитьАдресИОписаниеФайлаАсинх(ЭтотОбъект.УникальныйИдентификатор,Истина);
	
	ЭтотОбъект.АдресКартинкиВХ = АдресИОписаниеФайла.Адрес;
	ЭтотОбъект.РазмерФайла = АдресИОписаниеФайла.РазмерФайла;
	ЭтотОбъект.РасширениеФайла = АдресИОписаниеФайла.РасширениеФайла;
	
	ЭтотОбъект.Модифицированность = Истина;
	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбщийСерверныйМодуль.ЗаписатьКартинкуИзВХ(Объект.Ссылка, ЭтотОбъект.АдресКартинкиВХ, ЭтотОбъект.РазмерФайла,ЭтотОбъект.РасширениеФайла);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.АдресКартинкиВХ = ОбщийСерверныйМодуль.ПолучитьАдресКартинкиИзВХ(Объект.Ссылка,ЭтотОбъект.УникальныйИдентификатор);
КонецПроцедуры
