
Функция ЕстьОтрицательныеБонусы(ДокументСсылка) Экспорт
	
	Если Ложь Тогда    
		ДокументСсылка = Документы.ПокупкаЗаБонусы.ПустаяСсылка(); 	
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиБонусовОстатки.Студент КАК Студент,
	|	ОстаткиБонусовОстатки.БонусыОстаток КАК БонусыОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиБонусов.Остатки(&ПериодОтбора, Студент = &Студент) КАК ОстаткиБонусовОстатки
	|ГДЕ
	|	ОстаткиБонусовОстатки.БонусыОстаток < 0";
	
	ПериодОтбора = Новый Граница(ДокументСсылка.МоментВремени());
	Запрос.УстановитьПараметр("ПериодОтбора", ПериодОтбора);
	Запрос.УстановитьПараметр("Студент", ДокументСсылка.Студент);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Отказ = Ложь;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();	
		ТекстШаблона = "У студента ""%1"" не хватает бонусов: %2";
		СтрокаВывода = СтрШаблон(ТекстШаблона, Выборка.Студент, -Выборка.БонусыОстаток);
		Сообщить(СтрокаВывода);
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ;
	
	
КонецФункции // ЕстьОтрицательныеБонусы()
