
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиБонусов Приход
	Движения.ОстаткиБонусов.Записывать = Истина;
	Движение = Движения.ОстаткиБонусов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Бонусы = НачальныйКапитал;

	// регистр ОстаткиРейтинга Приход
	Движения.ОстаткиРейтинга.Записывать = Истина;
	Движение = Движения.ОстаткиРейтинга.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Рейтинг = НачальныйРейтинг;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
