
Процедура ЗаписатьФайлВБазу(ОбъектСсылка,ДвоичныеДанныеФайла,РазмерФайла,РасширениеФайла) Экспорт
	
	//то же самое что и РегистрыСведений.Файлы.СоздатьМенеджерЗаписи();
	ЗаписьФайла = СоздатьМенеджерЗаписи(); 
	
	СжатиеДанных = Новый СжатиеДанных(9);
	ДвоичныеДанные_ХранилищеЗначения = Новый ХранилищеЗначения(ДвоичныеДанныеФайла,СжатиеДанных);
	
	ЗаписьФайла.Объект = ОбъектСсылка; 
	ЗаписьФайла.ДанныеФайла = ДвоичныеДанные_ХранилищеЗначения;
	ЗаписьФайла.РазмерФайла = РазмерФайла;
	ЗаписьФайла.РасширениеФайла = РасширениеФайла; 
	
	ЗаписьФайла.Записать(Истина);
КонецПроцедуры


Функция ПолучитьСтруктуруДанныхФайлаИзБазы(ОбъектСсылка) Экспорт
	ЧтениеФайла = СоздатьМенеджерЗаписи();
	ЧтениеФайла.Объект = ОбъектСсылка;
	ЧтениеФайла.Прочитать();
	
	СтруктураДанных = Новый Структура("ДвоичныеДанныеФайла, РасширениеФайла");
	СтруктураДанных.ДвоичныеДанныеФайла = ЧтениеФайла.ДанныеФайла.Получить();
	СтруктураДанных.РасширениеФайла = ЧтениеФайла.РасширениеФайла;
	
	Возврат СтруктураДанных;
КонецФункции

