
&НаСервере
Процедура ПокупкаПриИзмененииНаСервере()
	Объект.Сумма = Объект.Покупка.Стоимость;
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаПриИзменении(Элемент)
	ПокупкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Студент) Тогда
	
		 Объект.Группа = ПараметрыСеанса.ТекущийСтудент.Владелец.Ссылка;
		 Объект.Студент = ПараметрыСеанса.ТекущийСтудент.Ссылка;
	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли = Метаданные.Роли.Студент Тогда
	
		 Объект.Группа = ПараметрыСеанса.ТекущийСтудент.Владелец.Ссылка;
		 Объект.Студент = ПараметрыСеанса.ТекущийСтудент.Ссылка;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
