&НаКлиенте
Асинх Функция ПолучитьИмяФайлаАсинх(Режим) Экспорт
	//открываем проводник для выбора файла
	Проводник = Новый ДиалогВыбораФайла(Режим); 	
	
	Если Режим = РежимДиалогаВыбораФайла.Открытие Тогда
		Проводник.ПроверятьСуществованиеФайла = Истина;
	КонецЕсли; 
	
	Результат = Ждать Проводник.ВыбратьАсинх();
	
	Если Результат = Неопределено Тогда
		ВызватьИсключение "Не удалось получить имя файла";
	КонецЕсли;
	
	Возврат Проводник.ПолноеИмяФайла;
КонецФункции // ()

&НаКлиенте
Асинх Функция ПолучитьОписаниеФайлаАсинх(ИмяФайла) Экспорт

	Файл = Новый Файл(ИмяФайла);
	
	Если Не (Ждать Файл.СуществуетАсинх()) Тогда
		ВызватьИсключение "Файла не существует: "+ИмяФайла;
	КонецЕсли;
	
	ОписаниеФайла = Новый Структура("РазмерФайла,РасширениеФайла");
    ОписаниеФайла.РазмерФайла = Ждать Файл.РазмерАсинх();
	ОписаниеФайла.РасширениеФайла = Файл.Расширение;
	
	Возврат ОписаниеФайла;
КонецФункции // ПолучитьОписаниеФайлаАсинх()

&НаКлиенте
Асинх Функция ПолучитьАдресИОписаниеФайлаАсинх(УникальныйИдентификатор,ЭтоКартинка=Ложь)Экспорт
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ИмяФайла = Ждать ПолучитьИмяФайлаАсинх(Режим);
	ОписаниеФайла = Ждать ПолучитьОписаниеФайлаАсинх(ИмяФайла);
	РасширенияКартинок = ".jpg .jpeg .png .gif .svg";
	
	Если СтрНайти(РасширенияКартинок,ОписаниеФайла.РасширениеФайла)=0 и ЭтоКартинка Тогда
		ВызватьИсключение "Выбранный файл не является картинкой!";
	КонецЕсли;
	
	ПомещаемыйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,,ИмяФайла,УникальныйИдентификатор);
	
	АдресФайла = ПомещаемыйФайл.Адрес;
	ОписаниеФайла.Вставить("Адрес",АдресФайла);
	Возврат ОписаниеФайла;
КонецФункции // ()

