


&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Объект.Наименование = Объект.Фамилия +" " +Лев(Объект.Имя,1)+".";
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	Объект.Наименование = Объект.Фамилия +" "+ Лев(Объект.Имя,1)+"."+Лев(Объект.Отчество,1)+".";
КонецПроцедуры

&НаСервере
Процедура ДостиженияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Достижения.Ссылка КАК ДостижениеСсылка,
	|	Достижения.ПрограммнаяЛогика КАК ПрограммнаяЛогика,
	|	ЛОЖЬ КАК УсловиеВыполнено
	|ИЗ
	|	Справочник.Достижения КАК Достижения";
	
	РезультатЗапроса = Запрос.Выполнить();
	//проверяем запрос на наличие записей
	Если РезультатЗапроса.Пустой() Тогда
		//если запрос оказался пустым - прерываем выполнение процедуры
		//и выводим текст ошибки
		ВызватьИсключение "Нет доступных достижений";
	КонецЕсли; 
	//выгружаем результат выполнения запроса в таблицу
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	// с помощью цикла перебираем каждую строку результата запроса
	Для каждого Строка Из ТаблицаРезультата Цикл
		Выполнить(Строка.ПрограммнаяЛогика);
	КонецЦикла;
	//создаем структуру для отбора строк из ТаблицаРезультата
	СтруктураОтбора = Новый Структура("УсловиеВыполнено", Истина);
	//выбираем только те строки, которые удовлетворяют условию отбора
	ТаблицаДостижений = ТаблицаРезультата.НайтиСтроки(СтруктураОтбора);
	//записываем данные в регистр сведений ПолученныеДостижения
	ЗафиксироватьДостиженияВРегистре(ТаблицаДостижений);
	//устанавливаем значения для параметра запроса из СписокДостижений
	СписокДостижений.Параметры.УстановитьЗначениеПараметра("Студент",Объект.Ссылка);
КонецПроцедуры  

&НаСервере
Процедура ЗафиксироватьДостиженияВРегистре(ТаблицаДостижений)

	Для каждого Строка Из ТаблицаДостижений Цикл
		//создаем новую запись в регистре сведений
	    НоваяЗапись = РегистрыСведений.ПолученныеДостижения.СоздатьМенеджерЗаписи();
		//заполняем измерение студент ссылкой на студента чей профиль просматривается
		НоваяЗапись.Студент = Объект.Ссылка;  
		//заполняем измерение достижение данными из таблицы
		НоваяЗапись.Достижение = Строка.ДостижениеСсылка; 
		//получаем адрес картинки во вх по сслыке на достижение
		НоваяЗапись.АдресВХ = ОбщийСерверныйМодуль.ПолучитьАдресКартинкиИзВХ(Строка.ДостижениеСсылка, Неопределено);
		//записываем данные в базу, если подобная запись уже есть - замещаем ее
		НоваяЗапись.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Достижения(Команда)
	ДостиженияНаСервере(); 
	ПоказатьОповещениеПользователя("Список достижений обновлен!");
	Элементы.СписокДостижений.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДостиженияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДостиженияНаСервере();
КонецПроцедуры
