
&НаКлиенте
Процедура Зарегистрироваться(Команда) 
	//очистка предыдущих сообщений о незаполненных полях
	ОчиститьСообщения();
	Если ПустаяСтрока(ЭтотОбъект.Email) Тогда
		Сообщить("Вы не ввели email!");
		Возврат;
	КонецЕсли;  
	Если ПустаяСтрока(ЭтотОбъект.Группа) Тогда
		Сообщить("Вы не ввели группу!");
		Возврат;
	КонецЕсли;  
	Если ПустаяСтрока(ЭтотОбъект.Никнейм) Тогда
		Сообщить("Вы не ввели никнейм!");
		Возврат;
	КонецЕсли;    
	Если ПустаяСтрока(ЭтотОбъект.Фамилия) Тогда
		Сообщить("Вы не ввели фамилию!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.Имя) Тогда
		Сообщить("Вы не ввели имя!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.НомерТелефона) Тогда
		Сообщить("Вы не ввели номер телефона!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.Пароль) Тогда
		Сообщить("Вы не ввели пароль!");
		Возврат;
	КонецЕсли;
    Если ПустаяСтрока(ЭтотОбъект.ПовторПароль) Тогда
		Сообщить("Вы не подтвердили пароль!");
		Возврат;
	КонецЕсли;
    Если НЕ ЭтотОбъект.ПовторПароль=ЭтотОбъект.Пароль Тогда
		Сообщить("Пароли не совпадают");
		Возврат;
	КонецЕсли;

	ЗарегистрироватьсяНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьсяНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры
