
&НаКлиенте
Процедура Зарегистрироваться(Команда) 
	//очистка предыдущих сообщений о незаполненных полях
	ОчиститьСообщения();
	Если ПустаяСтрока(ЭтотОбъект.Email) Тогда
		Сообщить("Вы не ввели email!");
		Возврат;
	КонецЕсли;  
	Если ПустаяСтрока(ЭтотОбъект.Группа) Тогда
		Сообщить("Вы не ввели группу!");
		Возврат;
	КонецЕсли;  
	Если ПустаяСтрока(ЭтотОбъект.Никнейм) Тогда
		Сообщить("Вы не ввели никнейм!");
		Возврат;
	КонецЕсли;    
	Если ПустаяСтрока(ЭтотОбъект.Фамилия) Тогда
		Сообщить("Вы не ввели фамилию!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.Имя) Тогда
		Сообщить("Вы не ввели имя!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.НомерТелефона) Тогда
		Сообщить("Вы не ввели номер телефона!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.Пароль) Тогда
		Сообщить("Вы не ввели пароль!");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.ПовторПароль) Тогда
		Сообщить("Вы не подтвердили пароль!");
		Возврат;
	КонецЕсли;
	Если НЕ ЭтотОбъект.ПовторПароль=ЭтотОбъект.Пароль Тогда
		Сообщить("Пароли не совпадают");
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьсяНаСервере();
    ЗавершитьРаботуСистемы(,Истина, "/N" + ЭтотОбъект.Никнейм);
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьсяНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйСтудент = СоздатьСтудентаНаСервере();
	
	НачислитьНачальныйБюджетСтудента(НовыйСтудент);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Функция СоздатьСтудентаНаСервере()
	
	НовыйСтудентПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйСтудентПользователь.Имя = ЭтотОбъект.Никнейм;
	НовыйСтудентПользователь.ПолноеИмя = ЭтотОбъект.Фамилия +" "+ЭтотОбъект.Имя+" "+ЭтотОбъект.Отчество;
	НовыйСтудентПользователь.АдресЭлектроннойПочты = ЭтотОбъект.Email;
	НовыйСтудентПользователь.Пароль = ЭтотОбъект.Пароль;
	НовыйСтудентПользователь.ПоказыватьВСпискеВыбора = Ложь;
	
	НовыйСтудентПользователь.Роли.Добавить(Метаданные.Роли.Студент);
	НовыйСтудентПользователь.Записать();
	
	НовыйСтудентЭлемент = Справочники.Студенты.СоздатьЭлемент();
	НовыйСтудентЭлемент.Владелец = ЭтотОбъект.Группа;
	НовыйСтудентЭлемент.Имя = ЭтотОбъект.Имя;
	НовыйСтудентЭлемент.Фамилия = ЭтотОбъект.Фамилия;
	НовыйСтудентЭлемент.Отчество = ЭтотОбъект.Отчество;
	НовыйСтудентЭлемент.Телефон = ЭтотОбъект.НомерТелефона;
	НовыйСтудентЭлемент.ДатаРождения = ЭтотОбъект.ДатаРождения;
	НовыйСтудентЭлемент.Наименование =  ЭтотОбъект.Фамилия +" "+ Лев(ЭтотОбъект.Имя,1)+"."+Лев(ЭтотОбъект.Отчество,1)+".";
	
	
	
	возврат	НовыйСтудентЭлемент.Ссылка;
КонецФункции // ()

&НаСервере
Процедура НачислитьНачальныйБюджетСтудента(ИгрокСсылка)
	
	 СтартИгры = Документы.СтартИгры.СоздатьДокумент();
	 СтартИгры.Дата = ТекущаяДата();
	 СтартИгры.Студент = ИгрокСсылка;
	 СтартИгры.НачальныйКапитал = 50;
	
КонецПроцедуры

