
//работа с файлами
Функция ПолучитьАдресКартинкиИзВХ(Ссылка,УникальныйИдентификатор) Экспорт
	СтруктураДанных = РегистрыСведений.Файлы.ПолучитьСтруктуруДанныхФайлаИзБазы(Ссылка);
	ДвоичныеДанные =  СтруктураДанных.ДвоичныеДанныеФайла;
	
	Если ДвоичныеДанные <> Неопределено Тогда
		АдресКартинкиВх = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		Возврат АдресКартинкиВх;
	КонецЕсли;    
КонецФункции // ПолучитьАдресКартинкиИзВХ()


Процедура ЗаписатьКартинкуИзВХ(ОбъектСсылка,АдресКартинки,РазмерФайла,РасширениеФайла)   Экспорт
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресКартинки);
		РегистрыСведений.Файлы.ЗаписатьФайлВБазу(ОбъектСсылка,ДвоичныеДанные,РазмерФайла,РасширениеФайла);
	КонецЕсли;	
	
КонецПроцедуры
