

&НаСервере
Процедура ПричинаПовышенияРейтингаПриИзмененииНаСервере()
	Объект.Рейтинг =Объект.ПричинаПовышенияРейтинга.Стоимость;
	Элементы.Рейтинг.Доступность = Ложь;   
	Элементы.Комментарий.Видимость = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура ПричинаПовышенияРейтингаПриИзменении(Элемент)
	ПричинаПовышенияРейтингаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура РучнойВводРейтингаПриИзмененииНаСервере()
	Элементы.Рейтинг.Доступность = Истина;
	Объект.Рейтинг = 0; 
	Объект.ПричинаПовышенияРейтинга = "";  
	Элементы.Комментарий.Видимость = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РучнойВводРейтингаПриИзменении(Элемент)
	РучнойВводРейтингаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)    
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеРейтинга.Студент.Телефон КАК СтудентТелефон,
		|	Telegram_Пользователи.Телефон КАК Телефон,
		|	Telegram_Пользователи.IDПользователя КАК IDПользователя
		|ИЗ
		|	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеРейтинга КАК НачислениеРейтинга
		|		ПО Telegram_Пользователи.Телефон = НачислениеРейтинга.Студент.Телефон
		|ГДЕ
		|	НачислениеРейтинга.Студент = &Студент"; 
	
	Запрос.УстановитьПараметр("Студент",Объект.Студент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 АйдиПользователя = ВыборкаДетальныеЗаписи.IDПользователя;
	КонецЦикла;


	ТекстСообщения = "";
	Если РучнойВводРейтинга = Истина Тогда
	ТекстСообщения = ТекстСообщения+ "Вам было добавлено: " + Объект.Рейтинг+ " рейтинга" + Символы.ПС+"По причине: "+Объект.Комментарий+" CAADBQADiQMAAukKyAPZH7wCI2BwFxYE";

	Иначе
	ТекстСообщения = ТекстСообщения+ "Вам было добавлено: " + Объект.Рейтинг+ " рейтинга" + Символы.ПС+"По причине: "+Объект.ПричинаПовышенияРейтинга;
	
	
	КонецЕсли;
		Telegram_Сервер.ОтправитьСообщение(АйдиПользователя,ТекстСообщения);
КонецПроцедуры

