

Процедура ПрочитатьСообщенияПользователя() Экспорт 
	
	СтруктураНастроек = ПолучитьНастройкиTelegram();
	// Установка соединения
	Источник = "bot"+СтруктураНастроек.Token + "/getUpdates"  ;
	HTTPСоединение  =   Новый HTTPСоединение( СтруктураНастроек.API,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос(Источник);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния=200 Тогда
		
		Данные = ДесериализоватьJSON(HTTPОтвет.ПолучитьТелоКакСтроку());	
		
		Если Данные.ok И Данные.result.Количество()>0 Тогда
			
			//записываем историю сообщений
			Для каждого СтрокаМассива Из Данные.result Цикл
				
				СообщениеID =  СтрокаМассива.update_id;
				Если ПроверитьНаличиеСообщенияПоID(СообщениеID) Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаМассива.Свойство("message") Тогда
					
					//Обработаем  и запишем сообщение
					Команда = СтрокаМассива.message.text;
					ЗаписатьИсториюСообщений(СтрокаМассива.message,СообщениеID,Команда,СтрокаМассива.message.from.id);
					ОбработатьОтветПользователя(Команда, СтруктураНастроек, СтрокаМассива.message, СообщениеID);
				Иначе
					// обработаем кнопки	
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьОтветПользователя(Команда, СтруктураНастроек, СтруктураСообщения, СообщениеID)
	
	Отзыв = ЗапросОтзыва(СтруктураСообщения.from.id);
	
	Если Команда = "/reg" Тогда
		
		ОтветСистемы = "Укажите свой номер телефона, в формате ➕79999999999";
		
		Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(СтруктураСообщения.chat.id, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + ОтветСистемы;
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос(Приемник);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		ЗаписатьИсториюОтветов(ОтветСистемы, Команда, СообщениеID, СтруктураСообщения.from.id);
		
	ИначеЕсли СтрНайти(Команда, "+7") Тогда
		
		ОтветСистемы = "Спасибо, мы сохранили ваш контакт в системе. Чтобы узнать, что я умею используй команду /help";
		Телефон =Команда;
		
		ВернутьСоздатьПользователяTelegram(СтруктураСообщения.chat.first_name, СтруктураСообщения.from.id , Телефон);
		
		Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(СтруктураСообщения.chat.id, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + ОтветСистемы;
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос(Приемник);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		ЗаписатьИсториюОтветов(ОтветСистемы, Команда, СообщениеID, СтруктураСообщения.from.id);
		
	ИначеЕсли Команда = "/rating" Тогда
		
		СписокЗаказов = ПолучитьРейтинг(СтруктураСообщения.from.id);
		
		Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(СтруктураСообщения.chat.id, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + СписокЗаказов;
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос(Приемник);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		ЗаписатьИсториюОтветов(ОтветСистемы, Команда, СообщениеID, СтруктураСообщения.from.id);
	ИначеЕсли Команда = "/achievki" Тогда
		
		СписокЗаказов = ПолучитьДостижения(СтруктураСообщения.from.id);
		
		Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(СтруктураСообщения.chat.id, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + СписокЗаказов;
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос(Приемник);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		ЗаписатьИсториюОтветов(ОтветСистемы, Команда, СообщениеID, СтруктураСообщения.from.id);	
	ИначеЕсли Отзыв.ЭтоОтзыв Тогда
		
		ОтветСистемы = "Спасибо за отзыв";
		
		Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(СтруктураСообщения.chat.id, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + ОтветСистемы;
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос(Приемник);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		ЗаписатьИсториюОтветов(ОтветСистемы, Команда, СообщениеID, СтруктураСообщения.from.id);
	ИначеЕсли Команда = "/start" Тогда
		
		ОтветСистемы = "Привет, я Плюсик✌"+Символы.ПС+"Я помогу тебе отслеживать свой рейтинг и баланс бонусов"+Символы.ПС+"Скорее регистрируйся по команде /reg!";
		
		Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(СтруктураСообщения.chat.id, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + ОтветСистемы;
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос(Приемник);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		ЗаписатьИсториюОтветов(ОтветСистемы, Команда, СообщениеID, СтруктураСообщения.from.id);	
	ИначеЕсли Команда = "/help" Тогда
				Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандыTelegram.Наименование КАК Наименование,
		|	КомандыTelegram.Описание КАК Описание
		|ИЗ
		|	Справочник.КомандыTelegram КАК КомандыTelegram";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОтветСистемы = "Вот список команд, которые я знаю: "+Символы.ПС;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ОтветСистемы = ОтветСистемы +ВыборкаДетальныеЗаписи.Наименование+" - "+ВыборкаДетальныеЗаписи.Описание+Символы.ПС; 
	КонецЦикла;
	  Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(СтруктураСообщения.chat.id, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + ОтветСистемы;
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос(Приемник);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		ЗаписатьИсториюОтветов(ОтветСистемы, Команда, СообщениеID, СтруктураСообщения.from.id);
		
		
	Иначе 
		
		ОтветСистемы = "Такой команды нет";
		
		Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(СтруктураСообщения.chat.id, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + ОтветСистемы;
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос(Приемник);
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		ЗаписатьИсториюОтветов(ОтветСистемы, Команда, СообщениеID, СтруктураСообщения.from.id);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросОтзыва(ID)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Telegram_ИсторияСообщенийСрезПоследних.Сообщение КАК Сообщение,
	|	Telegram_ИсторияСообщенийСрезПоследних.Команда КАК Команда
	|ИЗ
	|	РегистрСведений.Telegram_ИсторияСообщений.СрезПоследних КАК Telegram_ИсторияСообщенийСрезПоследних
	|ГДЕ
	|	Telegram_ИсторияСообщенийСрезПоследних.Пользователь = &Пользователь
	|	И Telegram_ИсторияСообщенийСрезПоследних.ВидСообщения = &ВидСообщения
	|	И Telegram_ИсторияСообщенийСрезПоследних.Команда = ""Отзыв""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Telegram_ИсторияСообщенийСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("ВидСообщения", Перечисления.Telegram_ВидСообщения.Исходящее);
	Запрос.УстановитьПараметр("Пользователь", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Команда = "Отзыв" Тогда
			Структура = Новый Структура;
			Структура.Вставить("ЭтоОтзыв", Истина);
			Структура.Вставить("НомерЗаказа", ВыборкаДетальныеЗаписи.Сообщение);
			
			Возврат Структура;
		КонецЕсли;
		
	КонецЦикла;
	
	Структура = Новый Структура;
	Структура.Вставить("ЭтоОтзыв", Ложь);
	
	Возврат Структура;
	
КонецФункции

#Область ОбщиеФункции

Функция ПолучитьНастройкиTelegram() Экспорт 
	
	
	СтруктураНастроек  =  Новый Структура;
	СтруктураНастроек.Вставить("ИмяБота","");
	СтруктураНастроек.Вставить("Token","");
	СтруктураНастроек.Вставить("API","");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Telegram_Настройки.ИмяБота КАК ИмяБота,
	|	Telegram_Настройки.API КАК API,
	|	Telegram_Настройки.Token КАК Token
	|ИЗ
	|	РегистрСведений.Telegram_Настройки КАК Telegram_Настройки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество()>0 Тогда
		
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств( СтруктураНастроек, Выборка);
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции // ()

Функция ДесериализоватьJSON(СтрокаJSON)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Данные = ПрочитатьJSON(Чтение,Ложь);
	Чтение.Закрыть();
	
	Возврат Данные;
	
КонецФункции // ДесериализоватьJSON()

Функция ПроверитьНаличиеСообщенияПоID(IDСообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Telegram_ИсторияСообщений.Период КАК Период
	|ИЗ
	|	РегистрСведений.Telegram_ИсторияСообщений КАК Telegram_ИсторияСообщений
	|ГДЕ
	|	Telegram_ИсторияСообщений.IDСообщения = &IDСообщения";
	
	Запрос.УстановитьПараметр("IDСообщения", IDСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать(); 	
	
	Если Выборка.Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
		
		
	КонецЕсли;
	
КонецФункции // ()


Процедура ЗаписатьИсториюСообщений(СтруктураСообщения,IDСообщения,Команда,IDПользователя)
	
	МенеджерЗаписи = РегистрыСведений.Telegram_ИсторияСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Сообщение = СокрЛП(СтруктураСообщения.text);
	МенеджерЗаписи.Команда = Команда;
	МенеджерЗаписи.Пользователь = IDПользователя;
	МенеджерЗаписи.ВидСообщения = Перечисления.Telegram_ВидСообщения.Входящее;
	МенеджерЗаписи.IDСообщения = IDСообщения;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры


Процедура ЗаписатьИсториюОтветов(ОтветСистемы, Команда, IDСообщения, IDПользователя)     Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.Telegram_ИсторияСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Сообщение = ОтветСистемы;
	МенеджерЗаписи.Команда = Команда;
	МенеджерЗаписи.Пользователь = IDПользователя;
	МенеджерЗаписи.ВидСообщения = Перечисления.Telegram_ВидСообщения.Исходящее;
	МенеджерЗаписи.IDСообщения = IDСообщения;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры


Функция ВернутьСоздатьПользователяTelegram(ИмяПользователя, IDПользователя, Телефон = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Telegram_Пользователи.Телефон КАК Телефон
	|ИЗ
	|	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи
	|ГДЕ
	|	Telegram_Пользователи.IDПользователя = &IDПользователя";
	
	Запрос.УстановитьПараметр("IDПользователя", IDПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.Telegram_Пользователи.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяПользователя = ИмяПользователя;
		МенеджерЗаписи.Телефон = Телефон;
		МенеджерЗаписи.IDПользователя = IDПользователя;
		МенеджерЗаписи.Записать(ИСТИНА);
		
		Возврат Телефон;
		
	КонецЦикла;
	
	МенеджерЗаписи = РегистрыСведений.Telegram_Пользователи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПользователя = ИмяПользователя;
	МенеджерЗаписи.Телефон = Телефон;
	МенеджерЗаписи.IDПользователя = IDПользователя;
	МенеджерЗаписи.Записать(ИСТИНА);
	
	Возврат Телефон;
	
КонецФункции

Функция ПолучитьРейтинг(ID)
	
	Сообщение = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиРейтингаОстатки.РейтингОстаток КАК РейтингОстаток,
	|	Telegram_Пользователи.Телефон КАК Телефон,
	|	ОстаткиРейтингаОстатки.Студент.Телефон КАК СтудентТелефон
	|ИЗ
	|	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиРейтинга.Остатки КАК ОстаткиРейтингаОстатки
	|		ПО Telegram_Пользователи.Телефон = ОстаткиРейтингаОстатки.Студент.Телефон
	|ГДЕ
	|	Telegram_Пользователи.IDПользователя = &IDПользователя";
	
	Запрос.УстановитьПараметр("IDПользователя", ID);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщение = Сообщение + "Ваш рейтинг: " + ВыборкаДетальныеЗаписи.РейтингОстаток  + Символы.ПС;
	КонецЦикла;
	
	Сообщение = СокрЛП(Сообщение);
	Если Сообщение = "" Тогда
		Сообщение = "Вы еще не начали накапливать рейтинг";
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции    


Функция ПолучитьДостижения(ID)
     Сообщение = "";
     	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Telegram_Пользователи.Телефон КАК Телефон,
		|	Telegram_Пользователи.IDПользователя КАК IDПользователя,
		|	ПолученныеДостижения.Студент.Телефон КАК СтудентТелефон,
		|	ПолученныеДостижения.Достижение.Код КАК ДостижениеКод,
		|	ПолученныеДостижения.Достижение.Условие КАК ДостижениеУсловие
		|ИЗ
		|	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолученныеДостижения КАК ПолученныеДостижения
		|		ПО Telegram_Пользователи.Телефон = ПолученныеДостижения.Студент.Телефон
		|ГДЕ
		|	Telegram_Пользователи.IDПользователя = &IDПользователя";
	
	Запрос.УстановитьПараметр("IDПользователя", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Сообщение = "Вот список ваших достижений: "+Символы.ПС;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщение = Сообщение +"✅ "+ ВыборкаДетальныеЗаписи.ДостижениеКод + " - " + ВыборкаДетальныеЗаписи.ДостижениеУсловие+Символы.ПС;
	КонецЦикла;
	
	Сообщение = СокрЛП(Сообщение);
	Если Сообщение = "" Тогда
		Сообщение = "У вас еще нет достижений(";
	КонецЕсли;
	
	Возврат Сообщение;
	

КонецФункции // ()



Процедура ОтправитьСообщение(IDПользователя, ТекстСообщения) Экспорт 
	
	СтруктураНастроек = ПолучитьНастройкиTelegram();
	
	Приемник = "bot" + СтруктураНастроек.Token + "/sendMessage?chat_id=" + СтрЗаменить(Формат(IDПользователя, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") + "&text=" + ТекстСообщения;
	HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос(Приемник);
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	ЗаписатьИсториюОтветов(ТекстСообщения, "Оповещение", "", IDПользователя);
	
КонецПроцедуры

Процедура ЗапускБотов() Экспорт
	ПрочитатьСообщенияПользователя();
КонецПроцедуры

#КонецОбласти