
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиБонусов Расход
	Движения.ОстаткиБонусов.Записывать = Истина;
	Движение = Движения.ОстаткиБонусов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Бонусы = Сумма;
	
	
	Движения.ОстаткиБонусов.Записать();
	Движения.ОстаткиБонусов.БлокироватьДляИзменения = Истина;  
	Отказ = РегистрыНакопления.ОстаткиБонусов.ЕстьОтрицательныеБонусы(ЭтотОбъект.Ссылка);
КонецПроцедуры
